Revit 2027 API
CoordinationModelLinkUtils.SetVisibilityOverrideForCategory Method
 Sets the visibility override for the provided element category name inside the provided Coordination Model type.
Namespace: Autodesk.Revit.DB.ExternalData
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static void SetVisibilityOverrideForCategory(
	Document document,
	View view,
	ElementType coordinationModelType,
	string categoryName,
	bool visible
)
Public Shared Sub SetVisibilityOverrideForCategory (
	document As Document,
	view As View,
	coordinationModelType As ElementType,
	categoryName As String,
	visible As Boolean
)
public:
static void SetVisibilityOverrideForCategory(
	Document^ document,
	View^ view,
	ElementType^ coordinationModelType,
	String^ categoryName,
	bool visible
)
static member SetVisibilityOverrideForCategory :
        document : Document *
        view : View *
        coordinationModelType : ElementType *
        categoryName : string *
        visible : bool -> unit
Parameters
document Document
 The document.
view View
 The view.
coordinationModelType ElementType
 The Coordination Model type element where the provided element category name is found.
categoryName String
 The name of the category inside the provided Coordination Model type.
visible Boolean
 Sets the visibility override for the provided element category name inside the provided Coordination Model type.
Exceptions
Exception | Condition
ArgumentException |  document is not a project document. -or- The element coordinationModelType was not found in the given document. -or- The name categoryName is not a category name in the provided AutodeskDocs Coordination Model type.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements).
ModificationForbiddenException |  The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). -or- The document is being loaded, or is in the midst of another sensitive process.
ModificationOutsideTransactionException |  The document has no open transaction.
Remarks
 By default, the visibility setting has no override and its value is true.
See Also
Reference
CoordinationModelLinkUtils Class
Autodesk.Revit.DB.ExternalData Namespace